In [143]:
import pandas as pd

def find_managers(employee: pd.DataFrame) -> pd.DataFrame:
    grouped = employee.groupby('managerId').size().reset_index(name='directReports')
    man = grouped[grouped.directReports >=5][['managerId']]
    result = man.merge(employee, left_on='managerId', right_on='id') #,how='inner'
    return result[['name']]

In [144]:
employee = pd.DataFrame({   'id':[101,102,103,104,105,106],
                            'name':['John','Dan','James','Amy','Anne','Ron'],
                            'department':['A','A','A','A','A','B'],
                            'managerId':['NaN',101,101,101,101,101]})
                            
employee

    id   name department managerId
0  101   John          A       NaN
1  102    Dan          A       101
2  103  James          A       101
3  104    Amy          A       101
4  105   Anne          A       101
5  106    Ron          B       101

In [145]:
find_managers(employee)

   name
0  John